app/views/shared/_category_src.html.erb

SELECT "categories".* FROM "categories"
---
        <ul class="navbar-nav m-auto">
            <% Category.all.each do |category| %>