app/views/shared/_category_nav.html.erb

SELECT "categories".* FROM "categories"
---

<% Category.all.each do |category| %>