app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories"
---
  <div class="field">
    <%= form.collection_select(:category_id, Category.all, :id, :name, {prompt: "Choose a category"} ) %>