app/controllers/posts_controller.rb

  def index
    if params[:category].blank?
      @posts = Post.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @posts = Post.where(category_id: @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Electric Vehicles"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ? ORDER BY created_at DESC  [["category_id", 3]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Our Home"], ["content", "XXXXXx"], ["category_id", 1], ["created_at", "2019-06-04 19:53:05.038222"], ["updated_at", "2019-06-04 19:53:05.038222"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image", "tooth.jpg"], ["updated_at", "2019-06-09 17:15:23.284117"], ["id", 3]]